# Розберемо просту техніку кодування та декодування на основі серій. Наприклад,
# у нас є список із повторюваними спостереженнями якоїсь величини, вона може приймати
# значення X, Y або Z. Значення з'являються у довільному порядку та зберігаємо ми їх у ' \
# 'списку ["X", "X", "X", "Z", "Z", "X", "X", "Y", "Y", "Y", "Z", "Z"] ' \
#   'або рядку "XXXZZXXYYYZZ".
#
# Внаслідок чого ми можемо зменшити обсяг інформації, що зберігається?
# Стиснення можна досягти заміною групи повторюваних значень на одноразове
# значення та лічильник повторів: ["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]
#
# Напишіть рекурсивну функцію decode для декодування списку, закодованого
# цим способом. Як аргумент функція приймає закодований список. Функція має повернути розшифрований список елементів.

def decode(data):
    # decode_data = []
    # for i, char in enumerate(data):
    #     if char not in ('X', 'Y', 'Z'):
    #         decode_data.extend(data[i-1]*(char-1))
    #     else:
    #         decode_data.append(char)
    # return decode_data

    decode_data = []
    if not data:
        return decode_data
    if len(data) > 1:
        decode_data.extend(str(data[0]) * data[1])
        decode_data.extend(decode(data[2:]))
        return decode_data

print(decode(["X", 3, "Z", 2, "X", 2, "Y", 3, "Z", 2]))

