# def is_integer(s):
    
#     if len(s) == 0:
#         return False

# У Python існує рядкова функція isdigit(). Ця функція повертає True, 
# якщо всі символи в рядку є цифрами, і є принаймні один символ, інакше — False. 
# Напишіть функцію з ім'ям is_integer, яка розширюватиме функціональність isdigit().
# При перевірці рядка необхідно ігнорувати початкові та кінцеві прогалини в рядку. 
# Після виключення зайвих прогалин рядок вважається таким, що представляє ціле число, якщо:

# її довжина більша або дорівнює одному символу
# вона повністю складається з цифр
# передбачити виняток, що, можливо, є початковий знак "+" або "-", після якого мають йти цифри

def is_integer(s):
    s=str(s)
    s=s.strip(' ')
    if len(s) == 0:
        return False
    if s[0] == '+' or s[0] == '-':
        if s[1:].isdigit():
            return True
        else:
            return False
    else:
        return False
print(is_integer('   -j87   '))