# При аналізі даних часто виникає необхідність позбавитися екстремальних значень,
#  перш ніж почати працювати з даними далі. Напишіть функцію data_preparation,
#  яка приймає набір даних, список списків (Приклад: [[1,2,3],[3,4], [5,6]]).

# Функція повинна видаляти з переданих списків найбільше і найменше значення,
#  але якщо розмір списку понад два елементи. Після видалення даних з кожного 
# списку необхідно злити їх разом в один список, відсортувати його за зменшенням
#  та повернути отриманий список як результат (Для прикладу вище результат
# \ буде наступним: [6, 5, 4, 3, 2]).
def data_preparation(list_data):
    new_list = []
    for item in list_data:
        if len(item) > 2:
            item.remove(max(item))
            item.remove(min(item))
        new_list.extend(item)
        new_list.sort(reverse=True)
    return new_list
print(data_preparation([[1,2,3],[3,4], [5,6]]))