# "2+ 34-5 * 3" => ['2', '+', '34', '-', '5', '*', '3']
# З метою спрощення вважаємо, що числа можуть бути тільки цілими,
#  і вхідний рядок завжди міститиме математичний вираз, що складається з дужок, чисел та операторів.

# Зверніть увагу, що лексеми можуть відокремлюватися один від 
# одного різною кількістю прогалин, а можуть і не відокремлюватися зовсім.
#  Прогалини не є лексемами та до підсумкового списку потрапити не повинні.
def token_parser(s):
    s=s.replace(' ','')
    list_s = []
    begin = 0
    for count, char in enumerate(s):
        if char in ('+', '-', '*', '/', ')', '('):
            list_s.append(char)
        else:
            if count > begin:

        elif char.isdigit():

        
print(token_parser("2+ 34-5 * 32"))
print(token_parser("   "))
print(token_parser('(2+ 3) *4 - 5 * 3'))
print(token_parser('2+ (3 -  5) *4 - 5 * 3'))
