# Підсписком (sublist) називають список, що є складовою більшого списку. 
# Підсписок може містити один елемент, множину елементів або бути порожнім.

# Наприклад, [1], [2], [3] та [4] є підписками списку [1, 2, 3, 4]. 
# Список [2, 3] також входить до складу [1, 2, 3, 4], 
# але при цьому список [2, 4] не є підсписком [1, 2, 3, 4], 
# оскільки у вихідному списку числа 2 і 4 не є сусідами.

# Порожній список є підсписком будь-якого списку.

# Напишіть функцію all_sub_lists, що повертає список, 
# який містить всі можливі підписки заданого.

# Наприклад, якщо функції передано аргумент список [1, 2, 3], 
# то функція має повернути наступний список: 
# [[], [1], [2], [3], [1, 2], [2, 3], [1, 2, 3]].

# Функція all_sub_lists повинна повертати щонайменше один список з
#  порожнім підсписком [[]].
def all_sub_lists(data):
    all_sub_list = []
    all_sub_list.append([])
    for j in range(0, len(data)):
        for i in range(0, len(data)):
            if i+j < len(data)+1 and i != (i + j):
                print(data[i:i+j], i, i+j)
                all_sub_list.append(data[i:i+j])
    if len(data) != 0:
        all_sub_list.append(data)

    return all_sub_list

print(all_sub_lists([1, 2, 3, 4]))